app/controllers/api/v1/students_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      def set_student
        @student = User.find_by(id: params[:id], role: "student")